//=================================================
//
// [LifeManager.cpp] : ライフマネージャー処理
// Author:chikada shouya
//
//=================================================
#include "lifemanager.h"

//=================================================
// 静的メンバ変数
//=================================================
CLifeManager* CLifeManager::m_pInstance = nullptr; // インスタンス変数

//=================================================
// コンストラクタ
//=================================================
CLifeManager::CLifeManager() : m_pLife{}
{
	
}

//=================================================
// デストラクタ
//=================================================
CLifeManager::~CLifeManager()
{

}

//=================================================
// 初期化
//=================================================
HRESULT CLifeManager::Init(void)
{
	for (int nCnt = 0; nCnt < MAX_LIFE; nCnt++)
	{
		m_pLife[nCnt] = CLife::Create(D3DXVECTOR3(1200.0f - (80.0f * nCnt), 670.0f, 0.0f));
	}

	return S_OK;
}

//=================================================
// 破棄
//=================================================
void CLifeManager::Uninit(void)
{
	// シングルトンの破棄
	if (m_pInstance)
	{
		delete m_pInstance;
		m_pInstance = nullptr;
	}
}

//=================================================
// 更新
//=================================================
void CLifeManager::Update(void)
{

}

//=================================================
// 描画
//=================================================
void CLifeManager::Draw(void)
{

}

//=================================================
// インスタンス取得処理
//=================================================
CLifeManager* CLifeManager::Instance(void)
{
	// nullチェック
	if (m_pInstance == nullptr)
	{
		// インスタンス生成
		m_pInstance = new CLifeManager;
	}

	// 生成されたインスタンスを返す
	return m_pInstance;
}