//=================================================
// 
// プレイヤーマネージャーの処理全般
// [PlayerManager.cpp]
// 
// Author:chikada shouya
//
//=================================================
#include "playerManager.h"

//=================================================
// 静的メンバ変数
//=================================================
CPlayerManager* CPlayerManager::m_pInstance = nullptr; // インスタンス変数

//=================================================
// コンストラクタ
//=================================================
CPlayerManager::CPlayerManager() : m_pPlayer{}
{

}

//=================================================
// デストラクタ
//=================================================
CPlayerManager::~CPlayerManager()
{

}

//=================================================
// 初期化
//=================================================
HRESULT CPlayerManager::Init(D3DXVECTOR3 pos, D3DXVECTOR3 rot)
{
	m_pPlayer = CPlayer::Create(pos, rot);

	return S_OK;
}

//=================================================
// 破棄
//=================================================
void CPlayerManager::Uninit(void)
{
	// シングルトンの破棄
	if (m_pInstance)
	{
		delete m_pInstance;
		m_pInstance = nullptr;
	}
}

//=================================================
// 更新
//=================================================
void CPlayerManager::Update(void)
{
	
}

//=================================================
// 描画
//=================================================
void CPlayerManager::Draw(void)
{

}

//=================================================
// インスタンス取得処理
//=================================================
CPlayerManager* CPlayerManager::Instance(void)
{
	// nullチェック
	if (m_pInstance == nullptr)
	{
		// インスタンス生成
		m_pInstance = new CPlayerManager;
	}

	// 生成されたインスタンスを返す
	return m_pInstance;
}

