//=================================================
// 
// スコアマネージャーの処理全般
// [ScoreManager.cpp]
// 
// Author:chikada shouya
//
//=================================================
#include "scoremanager.h"

//=================================================
// 静的メンバ変数
//=================================================
CScoreManager* CScoreManager::m_pInstance = nullptr; // インスタンス変数

//=================================================
// コンストラクタ
//=================================================
CScoreManager::CScoreManager() : m_pScore{}
{

}

//=================================================
// デストラクタ
//=================================================
CScoreManager::~CScoreManager()
{

}

//=================================================
// 初期化
//=================================================
HRESULT CScoreManager::Init(D3DXVECTOR3 pos)
{
	m_pScore = CScore::Create(pos);

	return S_OK;
}

//=================================================
// 破棄
//=================================================
void CScoreManager::Uninit(void)
{
	// シングルトンの破棄
	if (m_pInstance)
	{
		delete m_pInstance;
		m_pInstance = nullptr;
	}
}

//=================================================
// 更新
//=================================================
void CScoreManager::Update(void)
{

}

//=================================================
// 描画
//=================================================
void CScoreManager::Draw(void)
{

}

//=================================================
// インスタンス取得処理
//=================================================
CScoreManager* CScoreManager::Instance(void)
{
	// nullチェック
	if (m_pInstance == nullptr)
	{
		// インスタンス生成
		m_pInstance = new CScoreManager;
	}

	// 生成されたインスタンスを返す
	return m_pInstance;
}

