//=================================================
// 
// タイムマネージャー処理全般
// [TimeManager.cpp]
// 
// Author:chikada shouya
//
//=================================================
#include "timemanager.h"

//=================================================
// 静的メンバ変数
//=================================================
CTimeManager* CTimeManager::m_pInstance = nullptr; // インスタンス変数

//=================================================
// コンストラクタ
//=================================================
CTimeManager::CTimeManager() : m_pTime{}
{

}

//=================================================
// デストラクタ
//=================================================
CTimeManager::~CTimeManager()
{

}

//=================================================
// 初期化
//=================================================
HRESULT CTimeManager::Init(D3DXVECTOR3 pos)
{
	m_pTime = CTimer::Create(pos);


	return S_OK;
}

//=================================================
// 破棄
//=================================================
void CTimeManager::Uninit(void)
{
	// シングルトンの破棄
	if (m_pInstance)
	{
		delete m_pInstance;
		m_pInstance = nullptr;
	}
}

//=================================================
// 更新
//=================================================
void CTimeManager::Update(void)
{

}

//=================================================
// 描画
//=================================================
void CTimeManager::Draw(void)
{

}

//=================================================
// インスタンス取得処理
//=================================================
CTimeManager* CTimeManager::Instance(void)
{
	// nullチェック
	if (m_pInstance == nullptr)
	{
		// インスタンス生成
		m_pInstance = new CTimeManager;
	}

	// 生成されたインスタンスを返す
	return m_pInstance;
}

