//=================================================
//
// [trajmanager.cpp]
// Author:chikada shouya
//
//=================================================
#include "trajmanager.h"

//=================================================
// 静的メンバ変数
//=================================================
CTrajManager* CTrajManager::m_pInstance = nullptr; // インスタンス変数

//=================================================
// コンストラクタ
//=================================================
CTrajManager::CTrajManager() : m_pTrajctory{}
{

}

//=================================================
// デストラクタ
//=================================================
CTrajManager::~CTrajManager()
{

}

//=================================================
// 初期化
//=================================================
HRESULT CTrajManager::Init(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXCOLOR col)
{
	m_pTrajctory = CMeshTrajectory::Create(pos, rot, col);

	return S_OK;
}

//=================================================
// 破棄
//=================================================
void CTrajManager::Uninit(void)
{
	// シングルトンの破棄
	if (m_pInstance)
	{
		delete m_pInstance;
		m_pInstance = nullptr;
	}
}

//=================================================
// 更新
//=================================================
void CTrajManager::Update(void)
{

}

//=================================================
// 描画
//=================================================
void CTrajManager::Draw(void)
{

}

//=================================================
// インスタンス取得処理
//=================================================
CTrajManager* CTrajManager::Instance(void)
{
	// nullチェック
	if (m_pInstance == nullptr)
	{
		// インスタンス生成
		m_pInstance = new CTrajManager;
	}

	// 生成されたインスタンスを返す
	return m_pInstance;
}

